20240114161043-creating_immutable_objects.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-01-31 Sat 09:19 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Creating Immutable Objects</title>
<meta name="author" content="Michael Leibbrandt" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Creating Immutable Objects</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org396287f">1. Creating Immutable Objects</a>
<ul>
<li><a href="#orgfff442e">1.1. 1. Declaring an Immutable Class</a>
<ul>
<li><a href="#orgeeb0e06">1.1.1. Mutable Object Example</a></li>
<li><a href="#orga4c67be">1.1.2. Immutable Object Example</a></li>
</ul>
</li>
<li><a href="#org01e1d76">1.2. 2. Performing a Defensive Copy</a>
<ul>
<li><a href="#org19c86db">1.2.1. Example</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org396287f" class="outline-2">
<h2 id="org396287f"><span class="section-number-2">1.</span> Creating Immutable Objects</h2>
<div class="outline-text-2" id="text-1">
<p>
The <code>immutable</code> objects pattern is an object­oriented design pattern in which an object <b>cannot be modified</b> after it is created.
</p>

<ul class="org-ul">
<li>Helpful when writing <b>secure code</b> because you don’t have to worry about the values changing.</li>
<li>Simplify code when dealing with <b>concurrency</b> since <code>immutable</code> objects can be easily shared between multiple threads.</li>
</ul>
</div>


<div id="outline-container-orgfff442e" class="outline-3">
<h3 id="orgfff442e"><span class="section-number-3">1.1.</span> 1. Declaring an Immutable Class</h3>
<div class="outline-text-3" id="text-1-1">
<ol class="org-ol">
<li>Mark the class as <code>final</code> or make all of the <code>constructors</code> <code>private</code>.</li>
<li>Mark all the <code>instance variables</code> <code>private</code> and <code>final</code>.</li>
<li><b>Don’t</b> define any setter methods.</li>
<li><b>Don’t</b> allow <code>referenced</code> mutable objects to be <b>modified</b>.
(It means you <b>shouldn’t</b> expose an accessor method for <code>mutable instance</code> fields.)</li>
<li>Use a <code>constructor</code> to set all properties of the object, making a <code>copy</code> if needed.</li>
</ol>
</div>


<div id="outline-container-orgeeb0e06" class="outline-4">
<h4 id="orgeeb0e06"><span class="section-number-4">1.1.1.</span> Mutable Object Example</h4>
<div class="outline-text-4" id="text-1-1-1">
<div class="org-src-container">
<pre class="src src-java">import java.util.*;

public final class Animal { // Not an immutable object declaration
    private final ArrayList&lt;String&gt; favoriteFoods;

    public Animal() {
        this.favoriteFoods = new ArrayList&lt;String&gt;();
        this.favoriteFoods.add("Apples");
    }

    public List&lt;String&gt; getFavoriteFoods() {
        return favoriteFoods;
    }
}
</pre>
</div>
<p>
We carefully followed the first three rules, but unfortunately, a malicious caller could still
modify our data:
</p>

<div class="org-src-container">
<pre class="src src-java">var zebra = new Animal();

System.out.println(zebra.getFavoriteFoods()); // [Apples]

zebra.getFavoriteFoods().clear();
zebra.getFavoriteFoods().add("Chocolate Chip Cookies");

System.out.println(zebra.getFavoriteFoods()); // [Chocolate Chip Cookies]
</pre>
</div>

<p>
It’s <b>not</b> an immutable object if we can change its contents!
</p>

<p>
If we don’t have a getter for the favoriteFoods object, how do callers access it?
Simple: by using delegate or wrapper methods to read the data (See below example)
</p>
</div>
</div>

<div id="outline-container-orga4c67be" class="outline-4">
<h4 id="orga4c67be"><span class="section-number-4">1.1.2.</span> Immutable Object Example</h4>
<div class="outline-text-4" id="text-1-1-2">
<div class="org-src-container">
<pre class="src src-java">import java.util.*;

public final class Animal { // An immutable object declaration
    private final List&lt;String&gt; favoriteFoods;

    public Animal() {
        this.favoriteFoods = new ArrayList&lt;String&gt;();
        this.favoriteFoods.add("Apples");
    }

    public int getFavoriteFoodsCount() {
        return favoriteFoods.size();
    }

    public String getFavoriteFoodsItem(int index) {
        return favoriteFoods.get(index);
    }
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org01e1d76" class="outline-3">
<h3 id="org01e1d76"><span class="section-number-3">1.2.</span> 2. Performing a Defensive Copy</h3>
<div class="outline-text-3" id="text-1-2">
<p>
So, what’s this about the <code>fifth</code> and final rule for creating <b>immutable</b> objects?
</p>

<p>
In designing our class, let’s say we want a rule that the data for <code>favoriteFoods</code> is provided by the caller and that it always contains at least one element.
</p>

<p>
This rule is often called an <a href="20240124070254-invariant.html#ID-f86f8b26-77b9-412d-9d9a-0001bbf9dba0">Invariant</a>; it is true any time we have an <code>instance</code> of the object.
</p>
</div>

<div id="outline-container-org19c86db" class="outline-4">
<h4 id="org19c86db"><span class="section-number-4">1.2.1.</span> Example</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
The <code>copy</code> operation is called a <code>defensive copy</code> because the copy is being made in case other code does something unexpected.
</p>

<p>
With this approach, our <code>Animal</code> class is once again immutable.
</p>

<div class="org-src-container">
<pre class="src src-java">import java.util.*;

public final class Animal { // Not an immutable object declaration
    private final ArrayList&lt;String&gt; favoriteFoods;

    public Animal(ArrayList&lt;String&gt; favoriteFoods) {
        if (favoriteFoods == null || favoriteFoods.size() == 0)
        throw new RuntimeException("favoriteFoods is required");
        this.favoriteFoods = new ArrayList&lt;String&gt;(favoriteFoods);
    }

    public int getFavoriteFoodsCount() {
        return favoriteFoods.size();
    }

    public String getFavoriteFoodsItem(int index) {
        return favoriteFoods.get(index);
    }
}
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
